/*
    na.h - v0.02
    Nick Aversano's C++ helper library

    This is a single header file with a bunch of useful stuff
    to replace the C++ standard library.
===========================================================================

LICENSE
    This software is dual-licensed to the public domain and under the following
    license: you are granted a perpetual, irrevocable license to copy, modify,
    publish, and distribute this file as you see fit.

CREDITS
    Written by Nick Aversano

VERSION HISTORY
    0.02  - replace nja with na, arena and thread clean up
    0.01  - Initial version
*/

#ifndef NA_H
#define NA_H

#include <stdarg.h>
#include <stdint.h>
#include <stddef.h>

//
// Environment
//

#if defined(_WIN32) || defined(_WIN64)
    #define OS_WINDOWS 1
#elif defined(__APPLE__)
    #define OS_MACOS 1
#elif defined(__unix__)
    #if defined(__linux__)
        #define OS_LINUX 1
    #else
        #error This UNIX operating system is not supported!
    #endif
#else
    #error [OS] Unsupported operating system!
#endif

#ifndef OS_WINDOWS
#define OS_WINDOWS 0
#endif

#ifndef OS_MACOS
#define OS_MACOS 0
#endif

#ifndef OS_LINUX
#define OS_LINUX 0
#endif

#if defined(_MSC_VER)
    #define COMPILER_MSVC 1
#elif defined(__GNUC__)
    #define COMPILER_GCC 1
#elif defined(__clang__)
    #define COMPILER_CLANG 1
#else
    #error Unknown compiler!
#endif

#ifndef COMPILER_MSVC
#define COMPILER_MSVC 0
#endif

#ifndef COMPILER_GCC
#define COMPILER_GCC 0
#endif


    void na_assert_handler(const char *prefix, const char *expr, const char *file, long int line, char *msg) {
        print("%s(%ld): %s: ", file, line, prefix);
        if (expr) {
            print( "`%s` ", expr);
        }
        if (msg) {
            print("- %s", msg);
        }
        print("\n");
    }

    #define assert(expr) do { if (!(expr)) { na_assert_handler("Assertion Failed", #expr, __FILE__, __LINE__, NULL); AssertBreak(); } } while (0)
#else
    #define assert(...)
#endif
#endif

#ifndef dump
#if DEBUG
    #define dump(var) print("%s: %s\n", #var, string_to_cstr(to_string(var)))
#else
    #define dump(...)
#endif
#endif

#ifndef StaticAssert
#define StaticAssert(expr) static_assert(expr, "")
#endif

#ifndef force_inline
    #if defined(__GNUC__) && (__GNUC__ >= 4)
        #define force_inline __attribute__((always_inline)) inline
    #elif defined(__llvm__)
        #define force_inline __attribute__((always_inline)) inline
    #elif defined(_MSC_VER)
        #define force_inline __forceinline
    #else
        #define force_inline inline
    #endif
#endif

#ifndef na_extern
    #define na_extern extern "C"
#endif

#ifndef dll_export
#if defined(_WIN32)
    #define dll_export na_extern __declspec(dllexport)
    #define dll_import na_extern __declspec(dllimport)
#else
    #define dll_export na_extern __attribute__((visibility("default")))
    #define dll_import na_extern
#endif
#endif

#if !defined(thread_local)
    #if defined(_MSC_VER) && _MSC_VER >= 1300
        #define thread_local __declspec(thread)
    #elif defined(__GNUC__)
        #define thread_local __thread
    #else
        #define thread_local thread_local
    #endif
#endif

#ifndef cast
#define cast(type) (type)
#endif

#ifndef size_of
#define size_of(x) ((isize)sizeof(x))
#endif

#ifndef count_of
#define count_of(array) (sizeof(array) / sizeof((array)[0]))
#endif

#ifndef offset_of
#define offset_of(Type, member) ((uint64_t) & (((Type *)0)->member))
#endif

#ifndef member_from_offset
#define member_from_offset(ptr, Type, offset) (*(Type *)((u8 *)ptr + offset))
#endif

#ifndef align_of
#define align_of(Type) ((isize)alignof(Type))
#endif

#ifndef global
#define global        static // Global variables
#define local         static // Local Persisting variables
#define function      static // Internal linkage
#endif

#define fallthrough

#if OS_WINDOWS
#pragma section(".roglob", read)
#define read_only __declspec(allocate(".roglob"))
#else
// TODO(rjf): figure out if this benefit is possible on non-Windows
#define read_only
#endif

#ifndef FourCC
#define FourCC(a, b, c, d) (((u32)(a) << 0) | ((u32)(b) << 8) | ((u32)(c) << 16) | ((u32)(d) << 24))
#endif

#define Swap(Type, a, b) do { Type tmp = (a); (a) = (b); (b) = tmp; } while (0)

#ifndef CONCAT
#define CONCAT_HELPER(x, y) x##y
#define CONCAT(x, y) CONCAT_HELPER(x, y)
#endif

#ifndef STRINGIFY
#define STRINGIFY2(x) #x
#define STRINGIFY(x) STRINGIFY2(x)
#endif

#ifndef defer
// Defer macro/thing.
template<typename T>
struct ExitScope {
    T lambda;
    ExitScope(T lambda) : lambda(lambda) {}
    ~ExitScope() { lambda(); }
    ExitScope(const ExitScope&);
private:
    ExitScope& operator =(const ExitScope&);
};

class ExitScopeHelp {
public:
    template<typename T>
    ExitScope<T> operator+(T t) { return t; }
};

#define defer const auto& CONCAT(defer__, __LINE__) = ExitScopeHelp() + [&]()
#endif

#ifndef SetFlag
#define SetFlag(flags, mask, enable) do { if (enable) { flags |= (mask); } else { flags &= ~(mask); } } while(0)
#endif

//
// Types
//

#ifndef NULL
    #define NULL 0
#endif

#ifndef null
    #define null nullptr
#endif

typedef uint8_t   u8;
typedef int8_t    i8;
typedef uint16_t  u16;
typedef int16_t   i16;
typedef uint32_t  u32;
typedef int32_t   i32;
typedef uint64_t  u64;
typedef int64_t   i64;
typedef float     f32;
typedef double    f64;
typedef size_t    usize;
typedef ptrdiff_t isize;

typedef i8  b8;
typedef i16 b16;
typedef i32 b32;

typedef u8 byte;
typedef i32 rune;

#define enum8(Type)  u8
#define enum16(Type) u16
#define enum32(Type) u32
#define enum64(Type) u64

#define U8_MAX  0xff
#define I8_MAX  0x7f
#define I8_MIN  0x80
#define U16_MAX 0xffff
#define I16_MAX 0x7fff
#define I16_MIN 0x8000
#define U32_MAX 0xffffffff
#define I32_MAX 0x7fffffff
#define I32_MIN 0x80000000
#define U64_MAX 0xffffffffffffffff
#define I64_MAX 0x7fffffffffffffff
#define I64_MIN 0x8000000000000000
#define F32_MIN 1.17549435e-38f
#define F32_MAX 3.40282347e+38f
#define F64_MIN 2.2250738585072014e-308
#define F64_MAX 1.7976931348623157e+308

#define USIZE_MIX U64_MIN
#define USIZE_MAX U64_MAX
#define ISIZE_MIX I64_MIN
#define ISIZE_MAX I64_MAX

StaticAssert(sizeof(u8)  == sizeof(i8));
StaticAssert(sizeof(u16) == sizeof(i16));
StaticAssert(sizeof(u32) == sizeof(i32));
StaticAssert(sizeof(u64) == sizeof(i64));

StaticAssert(sizeof(f32) == 4);
StaticAssert(sizeof(f64) == 8);

StaticAssert(sizeof(usize) == sizeof(isize));

StaticAssert(sizeof(u8)  == 1);
StaticAssert(sizeof(u16) == 2);
StaticAssert(sizeof(u32) == 4);
StaticAssert(sizeof(u64) == 8);

//
// Linked List Helpers
//

#define CheckNull(p) ((p)==0)
#define SetNull(p) ((p)=0)

#define QueuePush_NZ(f,l,n,next,zchk,zset) (zchk(f)?\
(((f)=(l)=(n)), zset((n)->next)):\
((l)->next=(n),(l)=(n),zset((n)->next)))
#define QueuePushFront_NZ(f,l,n,next,zchk,zset) (zchk(f) ? (((f) = (l) = (n)), zset((n)->next)) :\
((n)->next = (f)), ((f) = (n)))
#define QueuePop_NZ(f,l,next,zset) ((f)==(l)?\
(zset(f),zset(l)):\
(f)=(f)->next)
#define StackPush_N(f,n,next) ((n)->next=(f),(f)=(n))
#define StackPop_NZ(f,next,zchk) (zchk(f)?0:((f)=(f)->next))

#define DLLInsert_NPZ(f,l,p,n,next,prev,zchk,zset) \
(zchk(f) ? (((f) = (l) = (n)), zset((n)->next), zset((n)->prev)) :\
zchk(p) ? (zset((n)->prev), (n)->next = (f), (zchk(f) ? (0) : ((f)->prev = (n))), (f) = (n)) :\
((zchk((p)->next) ? (0) : (((p)->next->prev) = (n))), (n)->next = (p)->next, (n)->prev = (p), (p)->next = (n),\
((p) == (l) ? (l) = (n) : (0))))
