#ifndef NJA_H
#define NJA_H

//
// Basic
//

#ifndef NULL
  #define NULL 0
#endif

#ifndef null
  #define null nullptr
#endif

#ifndef print
  #include <stdio.h>
  #define print(...) do { printf(__VA_ARGS__); fflush(stdout); } while(0)
#endif

#ifndef print_to_buffer
  #include <stdio.h>
  #define print_to_buffer(data, max_length, format, args) vsnprintf(data, max_length, format, args)
#endif

#if DEBUG
#ifndef DEBUG_TRAP

  #if defined(_MSC_VER)
    #if _MSC_VER < 1300
    #define DEBUG_TRAP() __asm int 3 /* Trap to debugger! */
    #else
    #define DEBUG_TRAP() __debugbreak()
    #endif
  #else
    #define DEBUG_TRAP() __builtin_trap()
  #endif

#endif
#else
  #define DEBUG_TRAP()
#endif

#ifndef assert
#ifdef DEBUG
  void nja_assert_handler(char *prefix, char *expr, char *file, long int line, char *msg) {
    print("%s(%ld): %s: ", file, line, prefix);
    if (expr) {
      print( "`%s` ", expr);
    }
    if (msg) {
      print("- %s", msg);
    }
    print("\n");
  }

  #define assert(expr) do { if (!(expr)) { nja_assert_handler("Assertion Failed", #expr, __FILE__, __LINE__, NULL); DEBUG_TRAP(); } } while (0)
#else
  #define assert(...)
#endif
#endif

#if DEBUG
  #define dump(var) print("%s: %s\n", #var, string_to_cstr(to_string(var)))
#else
  #define dump(...)
#endif

#ifndef STATIC_ASSERT
#ifdef __cplusplus
  #define STATIC_ASSERT(expr) static_assert(expr, "")
#else
  #define STATIC_ASSERT(expr) _Static_assert(expr, "")
#endif
#endif

#if defined(__cplusplus)
  #define EXTERN extern "C"
#else
  #define EXTERN extern
#endif

#if defined(_WIN32)
  #define DLL_EXPORT EXTERN __declspec(dllexport)
  #define DLL_IMPORT EXTERN __declspec(dllimport)
#else
  #define DLL_EXPORT EXTERN __attribute__((visibility("default")))
  #define DLL_IMPORT EXTERN
#endif

#define cast(type) (type)

#define count_of(array) (sizeof(array) / sizeof((array)[0]))

#define offset_of(Type, member) ((uint64_t) & (((Type *)0)->member))

#define size_of(type) ((isize)sizeof(type))

#define CONCAT_HELPER(x, y) x##y
#define CONCAT(x, y) CONCAT_HELPER(x, y)

#define SWAP(Type, a, b) do { Type tmp = (a); (a) = (b); (b) = tmp; } while (0)

#if defined(__cplusplus) && !defined(defer)
// Defer macro/thing.
template<typename T>
struct ExitScope {
  T lambda;
  ExitScope(T lambda) : lambda(lambda) {}
  ~ExitScope() { lambda(); }
  ExitScope(const ExitScope&);
private:
  ExitScope& operator =(const ExitScope&);
};

class ExitScopeHelp {
public:
  template<typename T>
  ExitScope<T> operator+(T t) { return t; }
};

#define defer const auto& CONCAT(defer__, __LINE__) = ExitScopeHelp() + [&]()
#endif

#define set_flag(flags, flag, enable) do { if (enable) { flags |= (flag); } else { flags &= ~(flag); } } while(0)

#if defined(_WIN32) || defined(_WIN64)
  #define OS_WINDOWS 1
#elif defined(__APPLE__)
  #define OS_MACOS 1
#elif defined(__unix__)

  #if defined(__linux__)
    #define OS_LINUX 1
  #else
    #error This UNIX operating system is not supported!
  #endif

#else
  #error [OS] Unsupported operating system!
#endif

#ifndef OS_WINDOWS
  #define OS_WINDOWS 0
#endif

#ifndef OS_MACOS
  #define OS_MACOS 0
#endif

#ifndef OS_LINUX
  #define OS_LINUX 0
#endif

#if defined(_MSC_VER)
  #define COMPILER_MSVC 1
#elif defined(__GNUC__)
  #define COMPILER_GCC 1
#elif defined(__clang__)
  #define COMPILER_CLANG 1
#else
  #error Unknown compiler!
#endif

#ifndef COMPILER_MSVC
  #define COMPILER_MSVC 0
#endif

#ifndef COMPILER_GCC
  #define COMPILER_GCC 0
#endif

#ifndef COMPILER_CLANG
  #define COMPILER_CLANG 0
#endif

#if OS_WINDOWS
#include <intrin.h>
#endif

//
// Types
//

#include <stdint.h>
#include <stddef.h>

typedef uint8_t   u8;
typedef int8_t    i8;
typedef uint16_t  u16;
typedef int16_t   i16;
typedef uint32_t  u32;
typedef int32_t   i32;
typedef uint64_t  u64;
typedef int64_t   i64;
typedef float     f32;
typedef double    f64;
typedef size_t    usize;
typedef ptrdiff_t isize;

#define U8_MAX  0xff
#define I8_MAX  0x7f
#define I8_MIN  0x80
#define U16_MAX 0xffff
#define I16_MAX 0x7fff
#define I16_MIN 0x8000
#define U32_MAX 0xffffffff
#define I32_MAX 0x7fffffff
#define I32_MIN 0x80000000
#define U64_MAX 0xffffffffffffffff
#define I64_MAX 0x7fffffffffffffff
#define I64_MIN 0x8000000000000000
#define F32_MIN 1.17549435e-38f
#define F32_MAX 3.40282347e+38f
#define F64_MIN 2.2250738585072014e-308
#define F64_MAX 1.7976931348623157e+308

STATIC_ASSERT(sizeof(u8)  == sizeof(i8));
STATIC_ASSERT(sizeof(u16) == sizeof(i16));
STATIC_ASSERT(sizeof(u32) == sizeof(i32));
STATIC_ASSERT(sizeof(u64) == sizeof(i64));

STATIC_ASSERT(sizeof(f32) == 4);
STATIC_ASSERT(sizeof(f64) == 8);

STATIC_ASSERT(sizeof(usize) == sizeof(isize));

STATIC_ASSERT(sizeof(u8)  == 1);
STATIC_ASSERT(sizeof(u16) == 2);
STATIC_ASSERT(sizeof(u32) == 4);
STATIC_ASSERT(sizeof(u64) == 8);

//
// Helpers
//

bool nja_is_power_of_two(isize x) {
  return !(x & (x - 1));
}

u64 nja_next_power_of_two(u64 x) {
  assert(x != 0);

  --x;
  x |= x >> 1;
  x |= x >> 2;
  x |= x >> 4;
  x |= x >> 8;
  x |= x >> 16;
  x |= x >> 32;

  return ++x;
}

u64 nja_previous_power_of_two(u64 x) {
  x |= x >> 1;
  x |= x >> 2;
  x |= x >> 4;
  x |= x >> 8;
  x |= x >> 16;
  x |= x >> 32;
  return x - (x >> 1);
}

void *nja_align_forward(void *ptr, isize alignment) {
  usize p;

  assert(alignment >= 1);
  assert(nja_is_power_of_two(alignment));

  p = cast(usize)ptr;
  return cast(void *)((p + (alignment - 1)) & ~(alignment - 1));
}

u64 nja_align_offset(void *ptr, isize alignment) {
  usize base_address = (usize)ptr;

  assert(alignment >= 1);
  assert(nja_is_power_of_two(alignment));

  u64 align_offset = alignment - (base_address & (alignment - 1));
  align_offset &= (alignment - 1);

  return align_offset;
}

