/*
  nja.h - v0.01 
  Nick Aversano's C++ helper library

  This is a single header file with a bunch of useful stuff
  to replace the C++ standard library.
===========================================================================

LICENSE
  This software is dual-licensed to the public domain and under the following
  license: you are granted a perpetual, irrevocable license to copy, modify,
  publish, and distribute this file as you see fit.

CREDITS
  Written by Nick Aversano

VERSION HISTORY
  0.01  - Initial version
*/

#ifndef NJA_H
#define NJA_H

//
// Basic
//

#ifndef NULL
  #define NULL 0
#endif

#ifndef null
  #define null nullptr
#endif

#ifndef print
  #include <stdio.h>
  #define print(...) do { printf(__VA_ARGS__); fflush(stdout); } while(0)
#endif

#ifndef print_to_buffer
  #include <stdio.h>
  #define print_to_buffer(data, max_length, format, args) vsnprintf(data, max_length, format, args)
#endif

#if DEBUG
#ifndef debug_breakpoint
  #if defined(_MSC_VER)
    #if _MSC_VER < 1300
    #define debug_breakpoint() __asm int 3 /* Trap to debugger! */
    #else
    #define debug_breakpoint() __debugbreak()
    #endif
  #else
    #define debug_breakpoint() __builtin_trap()
  #endif
#endif
#else
  #define debug_breakpoint()
#endif

#ifndef assert
#ifdef DEBUG
  #ifndef assert_break
  #define assert_break debug_breakpoint
  #endif

  void nja_assert_handler(char *prefix, char *expr, char *file, long int line, char *msg) {
    print("%s(%ld): %s: ", file, line, prefix);
    if (expr) {
      print( "`%s` ", expr);
    }
    if (msg) {
      print("- %s", msg);
    }
    print("\n");
  }

  #define assert(expr) do { if (!(expr)) { nja_assert_handler("Assertion Failed", #expr, __FILE__, __LINE__, NULL); assert_break(); } } while (0)
#else
  #define assert(...)
#endif
#endif

#ifndef dump
#if DEBUG
  #define dump(var) print("%s: %s\n", #var, string_to_cstr(to_string(var)))
#else
  #define dump(...)
#endif
#endif

#ifndef STATIC_ASSERT
#define STATIC_ASSERT(expr) static_assert(expr, "")
#endif

#ifndef nja_inline
  #if defined(__GNUC__) && (__GNUC__ >= 4)
    #define nja_inline __attribute__((always_inline)) inline
  #elif defined(__llvm__)
    #define nja_inline __attribute__((always_inline)) inline
  #elif defined(_MSC_VER)
    #define nja_inline __forceinline
  #else
    #define nja_inline inline
  #endif
#endif

#ifndef nja_extern
  #define nja_extern extern "C"
#endif

#ifndef nja_dll_export
#if defined(_WIN32)
  #define nja_dll_export nja_extern __declspec(dllexport)
  #define nja_dll_import nja_extern __declspec(dllimport)
#else
  #define nja_dll_export nja_extern __attribute__((visibility("default")))
  #define nja_dll_import nja_extern
#endif
#endif

#if !defined(nja_thread_local)
  #if defined(_MSC_VER) && _MSC_VER >= 1300
    #define nja_thread_local __declspec(thread)
  #elif defined(__GNUC__)
    #define nja_thread_local __thread
  #else
    #define nja_thread_local thread_local
  #endif
#endif

#ifndef cast
#define cast(type) (type)
#endif

#ifndef size_of
#define size_of(x) ((isize)sizeof(x))
#endif

#ifndef count_of
#define count_of(array) (sizeof(array) / sizeof((array)[0]))
#endif

#ifndef offset_of
#define offset_of(Type, member) ((uint64_t) & (((Type *)0)->member))
#endif

#ifndef align_of
#define align_of(Type) ((isize)alignof(Type))
#endif

#ifndef nja_global
#define nja_global        static // Global variables
#define nja_internal      static // Internal linkage
#define nja_local         static // Local Persisting variables
#define nja_local_persist static // Local Persisting variables
#endif

#ifndef FOUR_CC
#define FOUR_CC(a, b, c, d) \
  (((u32)(a) << 0) | ((u32)(b) << 8) | ((u32)(c) << 16) | ((u32)(d) << 24))
#endif

#ifndef SWAP
#define SWAP(Type, a, b) do { Type tmp = (a); (a) = (b); (b) = tmp; } while (0)
#endif

#ifndef CONCAT
#define CONCAT_HELPER(x, y) x##y
#define CONCAT(x, y) CONCAT_HELPER(x, y)
#endif

#ifndef defer
// Defer macro/thing.
template<typename T>
struct ExitScope {
  T lambda;
  ExitScope(T lambda) : lambda(lambda) {}
  ~ExitScope() { lambda(); }
  ExitScope(const ExitScope&);
private:
  ExitScope& operator =(const ExitScope&);
};

class ExitScopeHelp {
public:
  template<typename T>
  ExitScope<T> operator+(T t) { return t; }
};

#define defer const auto& CONCAT(defer__, __LINE__) = ExitScopeHelp() + [&]()
#endif

#ifndef lambda
#define lambda(...) [](__VA_ARGS__)
#endif

#ifndef set_flag
#define set_flag(flags, mask, enable) do { if (enable) { flags |= (mask); } else { flags &= ~(mask); } } while(0)
#endif

#if defined(_WIN32) || defined(_WIN64)
  #define OS_WINDOWS 1
#elif defined(__APPLE__)
  #define OS_MACOS 1
#elif defined(__unix__)

  #if defined(__linux__)
    #define OS_LINUX 1
  #else
    #error This UNIX operating system is not supported!
  #endif

#else
  #error [OS] Unsupported operating system!
#endif

#ifndef OS_WINDOWS
#define OS_WINDOWS 0
#endif

#ifndef OS_MACOS
#define OS_MACOS 0
#endif

#ifndef OS_LINUX
#define OS_LINUX 0
#endif

#if defined(_MSC_VER)
  #define COMPILER_MSVC 1
#elif defined(__GNUC__)
  #define COMPILER_GCC 1
#elif defined(__clang__)
  #define COMPILER_CLANG 1
#else
  #error Unknown compiler!
#endif

#ifndef COMPILER_MSVC
#define COMPILER_MSVC 0
#endif

#ifndef COMPILER_GCC
#define COMPILER_GCC 0
#endif

#ifndef COMPILER_CLANG
#define COMPILER_CLANG 0
#endif

#if !defined(__cplusplus)
  #define BYTE_ORDER_LITTLE_ENDIAN    (!*(u8*)&(u16){1})
  #define BYTE_ORDER_BIG_ENDIAN (!BYTE_ORDER_LITTLE_ENDIAN)
#endif

#if OS_WINDOWS
#include <intrin.h>
#endif

#if OS_MACOS
#include <xmmintrin.h>
#endif

//
// Types
//

#include <stdint.h>
#include <stddef.h>

typedef uint8_t   u8;
typedef int8_t    i8;
typedef uint16_t  u16;
typedef int16_t   i16;
typedef uint32_t  u32;
typedef int32_t   i32;
typedef uint64_t  u64;
typedef int64_t   i64;
typedef float     f32;
typedef double    f64;
typedef size_t    usize;
typedef ptrdiff_t isize;

typedef i8  b8;
typedef i16 b16;
typedef i32 b32;

typedef u8 byte;
typedef i32 rune;

#define enum8(Type)  u8
#define enum16(Type) u16
#define enum32(Type) u32
#define enum64(Type) u64

#define U8_MAX  0xff
#define I8_MAX  0x7f
#define I8_MIN  0x80
#define U16_MAX 0xffff
#define I16_MAX 0x7fff
#define I16_MIN 0x8000
#define U32_MAX 0xffffffff
#define I32_MAX 0x7fffffff
#define I32_MIN 0x80000000
#define U64_MAX 0xffffffffffffffff
#define I64_MAX 0x7fffffffffffffff
#define I64_MIN 0x8000000000000000
#define F32_MIN 1.17549435e-38f
#define F32_MAX 3.40282347e+38f
#define F64_MIN 2.2250738585072014e-308
#define F64_MAX 1.7976931348623157e+308

#define USIZE_MIX U64_MIN
#define USIZE_MAX U64_MAX
#define ISIZE_MIX I64_MIN
#define ISIZE_MAX I64_MAX

STATIC_ASSERT(sizeof(u8)  == sizeof(i8));
STATIC_ASSERT(sizeof(u16) == sizeof(i16));
STATIC_ASSERT(sizeof(u32) == sizeof(i32));
STATIC_ASSERT(sizeof(u64) == sizeof(i64));

STATIC_ASSERT(sizeof(f32) == 4);
STATIC_ASSERT(sizeof(f64) == 8);

STATIC_ASSERT(sizeof(usize) == sizeof(isize));

STATIC_ASSERT(sizeof(u8)  == 1);
STATIC_ASSERT(sizeof(u16) == 2);
STATIC_ASSERT(sizeof(u32) == 4);
STATIC_ASSERT(sizeof(u64) == 8);

//
// Helpers
//

bool nja_is_power_of_two(isize x) {
  return !(x & (x - 1));
}

u64 nja_next_power_of_two(u64 x) {
  assert(x != 0);

  --x;
  x |= x >> 1;
  x |= x >> 2;
  x |= x >> 4;
  x |= x >> 8;
  x |= x >> 16;
  x |= x >> 32;

  return ++x;
}

u64 nja_previous_power_of_two(u64 x) {
  x |= x >> 1;
  x |= x >> 2;
  x |= x >> 4;
  x |= x >> 8;
  x |= x >> 16;
  x |= x >> 32;
  return x - (x >> 1);
}

inline u32 nja_rotate_left(u32 value, i32 amount) {
#if COMPILER_MSVC
  u32 result = _rotl(value, amount);
#else
  // TODO(casey): Actually port this to other compiler platforms!
  amount &= 31;
  u32 result = ((value << amount) | (value >> (32 - amount)));
#endif

  return result;
}

inline u32 nja_rotate_right(u32 value, i32 amount) {
#if COMPILER_MSVC
  u32 result = _rotr(value, amount);
#else
  // TODO(casey): Actually port this to other compiler platforms!
  amount &= 31;
  u32 result = ((value >> amount) | (value << (32 - amount)));
#endif

